app/controllers/misions_controller.rb

SELECT  "misions".* FROM "misions" ORDER BY priority LIMIT ? OFFSET ?  [["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "misions"
---
  def index
    @misions = Mision.order("priority").paginate( page: params[:page], per_page: 3)

SELECT "misions".* FROM "misions" ORDER BY title
---
  def open
    @misions = Mision.order("title")

SELECT "misions".* FROM "misions" ORDER BY title
---
  def closed
    @misions = Mision.order("title")

SELECT "misions".* FROM "misions" ORDER BY title
---
  def resolved
    @misions = Mision.order("title")

INSERT INTO "misions" ("title", "priority", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Hello Ruby"], ["priority", 3], ["status", 5], ["created_at", 2016-11-01 12:11:08 UTC], ["updated_at", 2016-11-01 12:11:08 UTC]]
---
  def create
    @mision = Mision.new(mision_params)

    respond_to do |format|
      if @mision.save

UPDATE "misions" SET "title" = ?, "updated_at" = ? WHERE "misions"."id" = ?  [["title", "Hello man"], ["updated_at", 2016-11-06 10:22:25 UTC], ["id", 4]]
---
  def update
    respond_to do |format|
      if @mision.update(mision_params)

SELECT  "misions".* FROM "misions" WHERE "misions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_mision
      @mision = Mision.find(params[:id])